Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: But because Git was initially a toolkit for a VCS rather than a full user-friendly VCS, it has a bunch of verbs that do low-level work and were designed to be chained together UNIX style or called from scripts.
es: Pero, debido al origen de Git como una caja de herramientas para un VCS en lugar de como un completo y amigable sistema VCS, existen unos cuantos verbos para realizar tareas de bajo nivel y que se diseñaron para poder ser utilizados de forma encadenada al estilo UNIX o para ser utilizados en scripts.

source: You want to pull the Rack project into your `master` project as a subdirectory.
es: Si se desea situar el proyecto Rack como una subcarpeta del proyecto `master`.

source: If you tell the script that it was, it stages the file to mark it as resolved for you.
es: Si le indicas que así ha sido, Git marca como preparado (staged) el archivo que acabamos de modificar.

source: Then, open the file with `File.open()` and write out the previously zlib-compressed content to the file with a `write()` call on the resulting file handle:
es: Después, puedes abrir un archivo con la orden `File.open()` y escribir contenido en él con la orden `write()`:

source: After you push your project up or have it imported from Subversion, you have a main project page that looks something like Figure 4-13.
es: Una vez hayas enviado (push) tu proyecto, o lo hayas importado desde Subversion, tendrás una página principal de proyecto tal como:

source: They’re all invoked by the `git am` command, so if you aren’t using that command in your workflow, you can safely skip to the next section.
es: Todos ellos se invocan al utilizar el comando 'git am', por lo que si no utilizas dicho comando, puedes saltar directamente a la siguiente sección.

source: Because we can’t cover all of them, and because I happen to work at one of them, we’ll use this section to walk through setting up an account and creating a new project at GitHub.
es: Por ser imposible el cubrir todos ellos, y porque da la casualidad de que trabajo en uno de ellos, concretamente, en esta sección veremos cómo crear una cuenta y nuevos proyectos albergados en 'GitHub'.

source: Your database contains the two new versions of the file as well as the first content you stored there:
es: Tu base de datos contendrá las dos nuevas versiones del archivo, así como el primer contenido que habias guardado en ella antes:

source: Insert 18333fig0411.png Figure 4-11.
es: Insert 18333fig0411.png Figura 4-11.

source: But instead of appending them manually to the `~/.ssh/authorized_keys` file on your server, you’ll add them, one key per file, into the `keydir` directory.
es: Pero en lugar de hacerlo manualmente sobre el archivo `~/.ssh/authorized_keys` de tu servidor, has de hacerlo --un archivo por clave-- en la carpeta 'keydir' del proyecto de control.

source: It takes the patch that was introduced in a commit and tries to reapply it on the branch you’re currently on.
es: Se trata de coger el parche introducido por una determinada confirmación de cambios e intentar reaplicarlo sobre la rama donde te encuentres en ese momento.

source: You can use this hook to do things like make sure none of the updated references are non-fast-forwards; or to check that the user doing the pushing has create, delete, or push access or access to push updates to all the files they’re modifying with the push.
es: Puedes utilizar este punto de enganche para realizar tareas tales como la de comprobar que ninguna de las referencias actualizadas no son de avance directo (non-fast-forward); o para comprobar que el usuario que realiza el envio tiene realmente permisos para para crear, borrar o modificar cualquiera de los archivos que está tratando de cambiar.

source: The next issue is your commit access.
es: La tercera variable es el nivel de acceso que tengas.

source: The script puts helpful instructions in the rebase message:
es: El propio script indica las instrucciones a seguir:

source: ## Git Objects ##
es: ## Los objetos Git ##

source: If you do happen to commit an object that hashes to the same SHA-1 value as a previous object in your repository, GIt will see the previous object already in your Git database and assume it was already written.
es: Si se da la casualidad de confirmar cambios en un objeto y que a este se le asigne el mismo código SHA-1 que otro ya existente en el repositorio. Al ver el objeto previamente almacenado en la base de datos, Git asumirá que este ya existía.

source: Notice the last line of the file, which begins with a `^`.
es: Merece destacar que la última línea de este archivo comenzaba con `^`-

source: She runs `git log` to find out:
es: Lo comprueba con el comando 'git log':

source: Type
es: Teclear

source: Git attribute data also allows you to do some interesting things when exporting an archive of your project.
es: Los atributos de Git permiten realizar algunas cosas interesantes cuando exportas un archivo de tu proyecto.

source: How can you recover that commit at this point?
es: ¿Cómo podriamos ahora recuperar esas confirmaciones de cambio?

source: Git will occasionally repack your database automatically, always trying to save more space.
es: De vez en cuando, Git, en su empeño por optimizar la ocupación de espacio, reempaqueta automaticamente toda la base de datos

source: By blaming `GITPackUpload.m` with the `-C` option, I could see where sections of the code originally came from:
es: Aplicando la opción `-C` de `git blame` sobre `GITPackUpload.m`, es posible ver de donde proviene cada sección del código:

source: In this chapter, you’ll see how to work with Git in a distributed environment as a contributor and an integrator.
es: En este capítulo, verás cómo trabajar con Git en un entorno distribuido, bien como colaborador o bien como integrador.

source: To remove remote branches, you must remove the ref files from the server manually.
es: Para borrar ramas remotas, tendrás que borrar los archivos de referencia manualmente sobre el propio servidor.

source: With these tools, it’s easy to get Git to work exactly the way you, your company, or your group needs it to.
es: Con estas operaciones, será facil conseguir que Git trabaje exactamente como tú, tu empresa o tu grupo necesiteis.

source: It’s strange, but it works.
es: Es algo extraño, pero ¡funciona!.

source: Finally, you’ll write your zlib-deflated content to an object on disk.
es: Para terminar, has de escribir el contenido comprimido en un objeto en disco.

source: ### Generating a Build Number ###
es: ### Generando un número de ensamblado ###

source: #### Triple Dot ####
es: #### Triple-punto ####

source: The last main caveat that many people run into involves switching from subdirectories to submodules.
es: Y una última problemática en que se suelen encontrar quienes intercambian de carpetas a submódulos.

source: If you want to see which specific SHA a branch points to, or if you want to see what any of these examples boils down to in terms of SHAs, you can use a Git plumbing tool called `rev-parse`.
es: Para ver a qué código SHA apunta una determinada rama, o si se desea conocer cómo se comportarian cualquiera de los ejemplos anteriores en términos de SHAs, se puede emplear el comando de fontaneria 'rev-parse'.

source: You can put patterns in your project’s `.gitignore` file to have Git not see them as untracked files or try to stage them when you run `git add` on them, as discussed in Chapter 2.
es: Se pueden indicar expresiones en el archivo '.gitignore' de tu proyecto para indicar a Git lo que debe considerar o no como archivos sin seguimiento, o lo que interará o no seleccionar cuando lances el comando 'git add', tal y como se indicó en el capítulo 2.

source: How you name the keys determines how you refer to the users in the `gitosis.conf` file.
es: Según pongas los nombres a estos archivos, así tendrás que referirte a los usuarios en el archivo 'gitosis.conf'.

source: In this example, you’d run the following:
es: Por ejemplo, puedes lanzar los comandos:

source: If the contributor is a Git user and was good enough to use the `format-patch` command to generate their patch, then your job is easier because the patch contains author information and a commit message for you.
es: Si la persona que contribuye es usuaria de Git y conoce lo suficiente como para utilizar el comando 'format-patch' al generar su parche, tendrás mucho camino recorrido al incorporarlo; ya que el parche traerá consigo información sobre el o la autora, además de un mensaje de confirmación de cambios.

source: Using submodules isn’t without hiccups, however.
es: El uso de submódulos tiene también sus contratiempos.

source: Then, you can fast-forward the base branch (`master`):
es: Después, puedes avanzar rápidamente la rama base ('master'):

source: If you make some changes and commit again, the next commit stores a pointer to the commit that came immediately before it.
es: Si haces más cambios y vuelves a confirmar, la siguiente confirmación guardará un apuntador a esta su confirmación precedente.

source: If you’ve committed whitespace issues but haven’t yet pushed upstream, you can run a `rebase` with the `--whitespace=fix` option to have Git automatically fix whitespace issues as it’s rewriting the patches.
es: Si has confirmado cambios con problemas de espaciado, pero no los has enviado (push) aún "aguas arriba". Puedes realizar una reorganización (rebase) con la opción '--whitespace=fix' para que Git corrija automáticamente los problemas según va reescribiendo los parches.

source: But remembering the SHA-1 key for each version of your file isn’t practical; plus, you aren’t storing the filename in your system — just the content.
es: Pero no es práctico esto de andar recordando la clave SHA-1 para cada versión de tu archivo; es más, realmente no estás guardando el nombre de tu archivo en el sistema, --solo su contenido--.

source: You can also have your rebase replay on something other than the rebase branch.
es: También puedes aplicar una reorganización (rebase) sobre otra cosa además de sobre la rama de reorganización.

source: You’ve seen a number of advanced tools that allow you to manipulate your commits and staging area more precisely.
es: Se han visto una serie de herramientas avanzadas que permiten manipular de forma precisa las confirmaciones de cambio y el área de preparación.

source: You can easily see that the file size and image dimensions have both changed.
es: Aquí se vé claramente que ha cambiado el tamaño del archivo y las dimensiones de la imagen.

source: ### Your Project ###
es: ### Tu proyecto ###

source: You still get the advantages of things like offline committing and vastly simpler branching and merging, but the workflow can be very similar; the main difference is that merges happen client-side rather than on the server at commit time.
es: Sigues disfrutando de ventajas tales como las confirmaciones offline y la mayor simplicidad en las ramificaciones/fusiones. Pero, en el fondo, la forma de trabajar será bastante similar; la mayor diferencia radica en que las fusiones (merge) se hacen en el lado cliente en lugar de en el servidor.

source: You can add the following line to your Git attributes file:
es: Puedes añadir la siguiente línea al archivo de atributos de Git:

source: Because you don’t download the whole history in those systems, this type of addition carries few consequences.
es: En esos sistemas, uno no se suele descargar la historia completa. Y, por tanto, los archivos enormes no tienen mayores consecuencias.

source: On the ACL file you looked at earlier, this `get_acl_access_data` method returns a data structure that looks like this:
es: Si lo aplicamos sobre la lista ACL descrita anteriormente, este método 'get acl access_data' devolverá una estructura de datos similar a esta:

source: Furthermore, if you push this history back up to the server, you’ll reintroduce all those rebased commits to the central server, which can further confuse people.
es: Es más, si luego tu envias (push) ese registro de vuelta al servidor, vas a introducir todas esas confirmaciones reorganizadas en el servidor central. Lo que puede confundir aún más a la gente.

source: First, you should check to make sure you don’t already have a key.
es: Ante todo, asegurarte que no tengas ya una clave.

source: It records the snapshots and then tries to figure out what was renamed implicitly, after the fact.
es: Git simplemente se limita a almacenar instantáneas (snapshots) de los archivos, para después intentar deducir cuáles han podido ser renombrados.

source: Insert 18333fig0901.png Figure 9-1.
es: Insert 18333fig0901.png Figura 9-1.

source: One common problem happens when a developer makes a change locally in a submodule but doesn’t push it to a public server.
es: Un problema típico se suele dar cuando un desarrollador realiza y confirma (commit) un cambio local en el submódulo, pero no lo envia (push) a un servidor público.

source: These instructions tell you exactly what to do.
es: Estas instrucciones indican exactamente lo que se ha de realizar.

source: This lets you clone another repository into your project and keep your commits separate.
es: Esto permite clonar un segundo repositorio dentro del repositorio del proyecto en que se está trabajando, manteniendo separadamente las confirmaciones de cambios en ambos repositorios.

source: These commands aren’t meant to be used manually on the command line, but rather to be used as building blocks for new tools and custom scripts.
es: Estos comando no están pensados para ser utilizados manualmente desde la línea de comandos; sino más bien para ser utilizados como bloques de construcción para nuevas herramientas y scripts de usuario personalizados.

source: At this point, you should be able to do most of the day-to-day tasks for which you’ll be using Git.
es: A estas alturas, ya podrás realizar la mayor parte de las tareas habituales trabajando con Git.

source: This is referred to as a merge commit and is special in that it has more than one parent.
es: Nos referimos a este proceso como "fusión confirmada". Y se diferencia en que tiene más de un padre.

source: You may not want to run `adduser` and set temporary passwords for every user.
es: Ya que tendrias que lanzar el comando 'adduser' e inventarte contraseñas temporales para cada uno.

source: However, if you want another file outside of your project to hold those values or have extra values, you can tell Git where that file is with the `core.excludesfile` setting.
es: Sin embargo, si quieres disponer de otro archivo fuera de tus proyectos o tener expresiones extra, puedes indicarselo a Git con el parámetro 'core.excludesfile'.

source: If you’re running it internally, and you set up DNS for `gitserver` to point to that server, then you can use the commands pretty much as is:
es: que dicho servidor es interno a vuestra red y que está asignado el nombre 'gitserver' en vuestro DNS. Podrás utlizar comandos tales como:

source: Commit history after featureA work.
es: Historial tras el trabajo en la funcionalidad A.

source: However, your reflog and a new set of refs that Git added when you did the `filter-branch` under `.git/refs/original` still do, so you have to remove them and then repack the database.
es: Pero, sin embargo, quedan referencias en el registro (reflog) y en el nuevo conjunto de referencias en `.git/refs/original` que Git ha añadido al procesar `filter-branch`. Por lo que has de borrar también estás y reempaquetar la base de datos.

source: That way, you can use private branches for work you don’t want to share, and push up only the topic branches you want to collaborate on.
es: De esta forma, puedes usar ramas privadas para el trabajo que no deseas compartir. Llevando a un remoto tan solo aquellas partes que deseas aportar a los demás.

source: Next, the client uploads a packfile of all the objects the server doesn’t have yet.
es: A continuación, el cliente envia un archivo empaquetado con todos los objetos que faltan en el servidor.

source: If your fix for issue #53 modified the same part of a file as the `hotfix`, you’ll get a merge conflict that looks something like this:
es: Por ejemplo, si en tu trabajo del problema #53 has modificado una misma porción que también ha sido modificada en el problema 'hotfix'. Puedes obtener un conflicto de fusión tal que:

source: The first place Git looks for these values is in an `/etc/gitconfig` file, which contains values for every user on the system and all of their repositories.
es: El primero de ellos es el archivo '/etc/gitconfig', que contiene valores para todos y cada uno de los usuarios en el sistema y para todos sus repositorios.

source: git:x:1000:1000::/home/git:/bin/sh
es: git:x:1000:1000::/home/git:/bin/shgit:x:1000:1000::/home/git:/bin/sh

source: GitHub is slightly different than most code-hosting sites in the way that it namespaces projects.
es: GitHub es ligeramente distinto a otros sitios de alberge, en tanto en cuanto que contempla espacios de nombres para los proyectos.

source: In Git versions 1.6 or newer, you can set the `receive.denyDeletes` and `receive.denyNonFastForwards` settings.
es: En las versiones a partir de la 1.6, puedes ajustar las opciones 'receive.denyDeletes' (prohibir borrados) y 'receive.denyNonFastForwards' (prohibir envios que no sean avances-rápidos).

source: Technically you won’t lose the work, but you won’t have a branch pointing to it, so it will be somewhat difficult to retrieive.
es: Técnicamente, no se pierde nada del trabajo. Simplemente, nos quedamos sin ninguna rama apuntando a él. Con lo que resulta problemático recuperar el acceso a los cambios.

source: # Git on the Server #
es: # Git en un servidor #

source: It rewrites every commit object downstream from the earliest tree you have to modify to remove a large file reference.
es: Se basan en reescribir todos los objetos confirmados aguas abajo desde el árbol más reciente modificado para borrar la referencia a un archivo enorme.

source: Without the `-3` option, it looks like a conflict.
es: Sin la opción '-3', tendríamos problemas.

source: One of the main advantages of this approach is that you can continue to work, and the maintainer of the main repository can pull in your changes at any time.
es: La principal ventaja de esta forma de trabajar es que puedes continuar trabajando, y la persona gestora del repositorio principal podrá recuperar (pull) tus cambios en cualquier momento.

source: It can look for four primary whitespace issues — two are enabled by default and can be turned off, and two aren’t enabled by default but can be activated.
es: Puede vigilar acerca de cuatro tipos de problemas de espaciado --dos los tiene activados por defecto, pero se pueden desactivar; y dos vienen desactivados por defecto, pero se pueden activar--.

source: In this section you’ll learn what rebasing is, how to do it, why it’s a pretty amazing tool, and in what cases you won’t want to use it.
es: En esta sección vas a aprender en qué consiste la reorganización, como utilizarla, por qué es una herramienta sorprendente y en qué casos no es conveniente utilizarla.

source: You can view the public key by running
es: Puedes ver esta clave pública con el comando

source: The main reason is speed.
es: Principalmente, por razones de velocidad.

source: The `-M` switch tells Git to look for renames.
es: La opción `-M` indica a Git que ha de mirar por si hay algo renombrado.

source: The sequence looks basically like this:
es: La secuencia será algo parecido a esto:

source: You and the other developers all have push access to the repository.
es: Tanto tu como el resto del equipo teneis acceso de envio (push) al repositorio.

source: You can set the color to any of the following values: normal, black, red, green, yellow, blue, magenta, cyan, or white.
es: Puedes ajustar un color a cualquiera de los siguientes valores: 'normal' (normal), 'black' (negro), 'green' (verde), 'yellow' (amarillo), 'blue' (azul oscuro), 'magenta' (rojo oscuro), 'cyan' (azul claro) o 'white' (blanco).

source: Benevolent dictator workflow.
es: Fujo de trabajo del dictador benevolente.

source: If you want to pull commit `e43a6` into your master branch, you can run
es: Si deseas integar únicamente la confirmación 'e43a6' en tu rama 'master', puedes lanzar:

source: The `pre-commit` hook is run first, before you even type in a commit message.
es: Primero se activa el punto de enganche 'pre-commit', incluso antes de que teclees el mensaje de confirmación.

source: ## Git References ##
es: ## Referencias Git ##

source: Basically, you need to run this command in a daemonized manner:
es: Tan solo necesitas lanzar este comando de forma demonizada:

source: Git uses a series of configuration files to determine non-default behavior that you may want.
es: Para determinar su comportamiento no estandar, Git emplea una serie de archivos de configuración.

source: Now you’re ready to add your contributed work into this topic branch and determine if you want to merge it into your longer-term branches.
es: Tras esto, estarás listo para añadir tu trabajo a esa rama puntual y ver si deseas o no fusionarla luego con alguna otra de tus ramas de más largo recorrido.

source: Having their carefully crafted work rejected at the last minute can be extremely frustrating and confusing; and furthermore, they will have to edit their history to correct it, which isn’t always for the faint of heart.
es: Ver rechazado en el último minuto su tan cuidadosamente preparado trabajo, puede ser realmente frustrante. Y, aún peor, tener que reescribir su histórico para corregirlo puede ser un auténtico calvario.

source: If you want an easier way to test the stashed changes again, you can run `git stash branch`, which creates a new branch for you, checks out the commit you were on when you stashed your work, reapplies your work there, and then drops the stash if it applies successfully:
es: Una forma más sencilla de reaplicar cambios es utilizando el comando `git stash branch`. Este comando crea una nueva rama, extrayendo (checkout) la confirmación de cambios original en la que se estaba cuando los cambios fueron guardados en la pila, reaplica estos sobre dicha rama y los borra de la pila si se consigue completar el proceso con éxito.

source: A higher probability exists that every member of your programming team will be attacked and killed by wolves in unrelated incidents on the same night.
es: Es mucho más probable que todos los miembros de nuestro equipo de programación fuesen atacados y matados por lobos, en incidentes no relacionados entre sí, acaecidos todos ellos en una misma noche.

source: A second method is to create a single 'git' user on the machine, ask every user who is to have write access to send you an SSH public key, and add that key to the `~/.ssh/authorized_keys` file of your new 'git' user.
es: La segunda forma es el crear un solo usuario 'git' en la máquina y solicitar a cada persona que te envie una clave pública SSH, para que puedas añadirlas al archivo `~/.ssh/authorized_keys` de dicho usuario 'git'.

source: The first is to set up accounts for everybody, which is straightforward but can be cumbersome.
es: La primera forma es el habilitar cuentas para todos; es la manera más directa, pero también la más laboriosa.

source: If you have a commit-message policy in place, then putting a template for that policy on your system and configuring Git to use it by default can help increase the chance of that policy being followed regularly.
es: Si tienes una política concreta con respecto a los mensajes de confirmación de cambios, puedes aumentar las posibilidades de que sea respetada si creas una plantilla acorde a dicha política y la pones como plantilla por defecto de Git.
